In [1]:
import numpy as np
import pandas as pd

# Creating DataFrame

In [5]:
data = {
    'Name' : ['Akarsh','Sarthak','Samay','Kartavya'],
    'Age' : [28,34,29,42],
    'City': ['New York' , 'Paris', 'Berlin' , 'Japan'],
    'Salary' : [65000 , 70000 , 62000 , 85000]
}

In [6]:
data

{'Name': ['Akarsh', 'Sarthak', 'Samay', 'Kartavya'],
 'Age': [28, 34, 29, 42],
 'City': ['New York', 'Paris', 'Berlin', 'Japan'],
 'Salary': [65000, 70000, 62000, 85000]}

In [10]:
df = pd.DataFrame(data)
df

       Name  Age      City  Salary
0    Akarsh   28  New York   65000
1   Sarthak   34     Paris   70000
2     Samay   29    Berlin   62000
3  Kartavya   42     Japan   85000

In [13]:
d_list = [
    ['Sahitya', 23 ,'Oman', 34000],
    ['Surya', 26 ,'Qatar', 98000],
    ['shubh', 22 ,'Russia', 56000],
    ['Sunny', 27 ,'Nepal', 23000],
]
df2 = pd.DataFrame(d_list)
col = ['name','age','city','salary']
df2 = pd.DataFrame(d_list, columns =col)

df2

      name  age    city  salary
0  Sahitya   23    Oman   34000
1    Surya   26   Qatar   98000
2    shubh   22  Russia   56000
3    Sunny   27   Nepal   23000

# Selection and Indexing Of columns

In [18]:
df

       Name  Age      City  Salary
0    Akarsh   28  New York   65000
1   Sarthak   34     Paris   70000
2     Samay   29    Berlin   62000
3  Kartavya   42     Japan   85000

In [19]:
df['Name']   #for targeting column Name

0      Akarsh
1     Sarthak
2       Samay
3    Kartavya
Name: Name, dtype: object

In [22]:
df['City']

0    New York
1       Paris
2      Berlin
3       Japan
Name: City, dtype: object

In [23]:
df[['Name','City']]    #multiple Column Selection

       Name      City
0    Akarsh  New York
1   Sarthak     Paris
2     Samay    Berlin
3  Kartavya     Japan

# Creating a New Column

In [24]:
df['Designation']=['Doctor','Eng','Doctor','Eng']

In [25]:
df

       Name  Age      City  Salary Designation
0    Akarsh   28  New York   65000      Doctor
1   Sarthak   34     Paris   70000         Eng
2     Samay   29    Berlin   62000      Doctor
3  Kartavya   42     Japan   85000         Eng

# Removing Column

In [26]:
df.drop('Designation',axis = 1)   #not deleted from the main dataframe

       Name  Age      City  Salary
0    Akarsh   28  New York   65000
1   Sarthak   34     Paris   70000
2     Samay   29    Berlin   62000
3  Kartavya   42     Japan   85000

In [28]:
df.drop('Designation', axis = 1 ,inplace = True)    #permanently delete

In [29]:
df

       Name  Age      City  Salary
0    Akarsh   28  New York   65000
1   Sarthak   34     Paris   70000
2     Samay   29    Berlin   62000
3  Kartavya   42     Japan   85000

In [31]:
df.drop(['City','Salary'] ,axis=1)

       Name  Age
0    Akarsh   28
1   Sarthak   34
2     Samay   29
3  Kartavya   42

In [33]:
df.drop( 0,axis=0)     #To remove first row

       Name  Age    City  Salary
1   Sarthak   34   Paris   70000
2     Samay   29  Berlin   62000
3  Kartavya   42   Japan   85000

# Selecting Row